#include <iostream> //библиотека для работы с потоками ввода/вывода
using namespace std; //работаем с пространством имён std
int main() {
	//инициализацция нужных для работы переменных
	const int n = 10; //константой задаём размер массива (в нашем случае 10)
	int mas[n][n]; //создаём массив целых чисел n на n (10 на 10)
	int locMin = 0; //переменная, счётчик, содержащая кол-во локальных минимувов
	int sum = 0; //переменная, которая будет содержать общую сумму модулей элементов, расположенных выше главной диагонали

	//далее задаём и сразу выводим массив на консоль
	cout << "Matrix :" << endl; //cout это поток вывода (то что выведется на экран консоли), помещаем "Matrix :" в поток с помощью перегруженного опператора <<
	for (int i = 0; i < n; i++) {  //этот цикл перебирает строки в двумерном массиве
		for (int j = 0; j < n; j++) { //этот цикл перебирает столбцы (или все эллементы в строке)
			mas[i][j] = rand() % 30 - 10; //присваивание случайного значения эллементу матрицы
			cout << mas[i][j] << "  "; //вывод этого эллемета
		}
		cout << endl; //перевод строки после каждого окончания  строки
	}

	//Вывод локальных минимумов
	cout << "Minimum :" << endl; //вывод на экран "Minimum :" и перевод строки
	for (int i = 0; i < n; i++) { //этот цикл перебирает строки в двумерном массиве
		for (int j = 0; j < n; j++) { //этот цикл перебирает столбцы (или все эллементы в строке)
			if ((mas[i][j] < mas[i][j - 1]) && (mas[i][j] < mas[i][j + 1]) && (mas[i][j] < mas[i + 1][j]) && (mas[i][j] < mas[i - 1][j])) { //если значение эллемента слева справа сверху снизу меньше значения выбранного эллемента, то (см. ниже)
				cout << "String " << i + 1 << " column " << j + 1 << " min = " << mas[i][j] << endl; //этот эллемент явл локальный минимум, и он выведется его на экран, также (см. ниже)
				locMin++; //переменная, которая хранит количество лок. минимувов увеличиться
			}
		}
	}
	cout << "Found " << locMin << " minimum"; //вывод количества минимумов

	//далее считаем  общую сумму модулей элементов, расположенных выше главной диагонали
	for (int i = 0; i < n; i++) { //этот цикл перебирает строки в двумерном массиве
		for (int j = i + 1; j < n; j++) { //этот цикл перебирает столбцы (или все эллементы в строке)
			sum += abs(mas[i][j]); //каждый эллемент по модуля прибавляется к общей сумме  //по модуля эллемент берётся при помощи ф-ции abs() 
		}
	}
	cout << endl << "Sum of the elements above the main diagonal = " << sum << endl; //выводим общую сумму модулей элементов, расположенных выше главной диагонали

	system("pause"); // Вывод сообщения о паузе + ожидании нажатия любой кнопки
	return 0; //Возвращение main ф-ции значения 0, т.е конец программы 
}