/*
Составить описание класса прямоугольников со сторонами, параллельными осям координат.
Реализовать:
- перемещения прямоугольников на плоскости,
- изменение размеров,
- построение наименьшего прямоугольника, содержащего два заданных прямоугольника, и прямоугольника, являющегося общей частью (пересечением) двух прямоугольников.
Написать программу, демонстрирующую работу с этим классом. Программа должна содержать меню, позволяющее осуществить проверку всех методов класса
*/
#include "Rectangle.h"
#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");

	cout << "Создание прямоугольника без параметров (использование конструктора по умолчанию)" << endl;
	Rectangle ObjectA; // Создаем объект без параметров, то есть будет использован конструктор по умолчанию

	char Control;
	while (true)
	{
		cout << endl;
		cout << "Интерфейс программы:" << endl;
		cout << "1. Ввод данных" << endl;
		cout << "2. Вывод" << endl;
		cout << "3. Перемещение" << endl;
		cout << "4. Изменение размера" << endl;
		cout << "5. Минимальный прямоугольник содержащий 2 заданных" << endl;
		cout << "6. Прямоугольник получившийся на пересечении 2 заданных" << endl;
		cout << ">";
		cin >> Control;
		switch (Control)
		{
		case '1':
			ObjectA.Input();
			break;
		case '2':
			ObjectA.Result();
			break;
		case '3':
			ObjectA.Peremeshenie();
			break;
		case '4':
			ObjectA.Size();
			break;
		case '5':
			ObjectA.Minimal();
			break;
		case '6':
			ObjectA.Сross();
			break;
		default: break;
		}
	}
	system("pause");
	return 0;
}